bit-finance/DataProcessors/бит_ПривязкаПланируемогоПоступленияДСКФактическому.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ПривязкаПланируемогоПоступленияДСКФактическому</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

bit-finance/Documents/бит_ОтражениеФактаДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ОтражениеФактаДДС</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеСинхронизировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетБанкаПоОперациямЭквайринга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачатПереходНаНовуюАрхитектуру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УдалитьХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСинхронизироватьСумму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСинхронизироватьПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФактическиеДанные</Name>
					<Comment>Фактические данные</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_1</Name>
							<Comment>Дополнительная аналитика № 1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_2</Name>
							<Comment>Дополнительная аналитика № 2</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_3</Name>
							<Comment>Дополнительная аналитика № 3</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_4</Name>
							<Comment>Дополнительная аналитика № 4</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_5</Name>
							<Comment>Дополнительная аналитика № 5</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_6</Name>
							<Comment>Дополнительная аналитика № 6</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_7</Name>
							<Comment>Дополнительная аналитика № 7</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_8</Name>
							<Comment>Дополнительная аналитика № 8</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_9</Name>
							<Comment>Дополнительная аналитика № 9</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_10</Name>
							<Comment>Дополнительная аналитика № 10</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_11</Name>
							<Comment>Дополнительная аналитика № 11</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_12</Name>
							<Comment>Дополнительная аналитика № 12</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Позиция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПозицияПоступления</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПлатежнаяПозиция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заблокировать</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчетов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаВзаиморасчетов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсЧислительВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсЗнаменательВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Аналитики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аналитика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеАналитики</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

bit-finance/DataProcessors/бит_ПривязкаПланируемогоПоступленияДСКФактическому/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Функция ОбновитьСвязанныеДокументы(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, ДанныеФормы) Экспорт
		
	ПравилаПоиска			 	   = ДанныеФормы.ПравилаПоиска;
	СкрыватьДокументыБезПары	   = ДанныеФормы.СкрыватьДокументыБезПары;
	АвтоПомечатьНаиболееПодходящие = ДанныеФормы.АвтоПомечатьНаиболееПодходящие;
	
	СхемаКомпоновкиДанных.СвязиНаборовДанных.Очистить();
	
	Связь = СхемаКомпоновкиДанных.СвязиНаборовДанных.Добавить();
	Связь.НаборДанныхИсточник = "НаборДанных1";
	Связь.НаборДанныхПриемник = "НаборДанных2";
	Связь.ВыражениеИсточник   = "Ссылка";
	Связь.ВыражениеПриемник   = "Ссылка";

	Связь = СхемаКомпоновкиДанных.СвязиНаборовДанных.Добавить();
	Связь.НаборДанныхИсточник = "НаборДанных1";
	Связь.НаборДанныхПриемник = "НаборДанных3";
	Связь.ВыражениеИсточник   = "Организация";
	Связь.ВыражениеПриемник   = "ППДС.Организация";

	ВидСравненияСумма = "";
	ВидСравненияДата  = "";
	
	Для каждого СтрокаТаблицы Из ПравилаПоиска Цикл
		Если СтрокаТаблицы.Пометка Тогда
			Если СтрокаТаблицы.ВыражениеИсточник = "Дата" Тогда
				бит_ОтчетыБФКлиентСервер.ДобавитьОтбор(НастройкиКомпоновкиДанных.Структура[0].Структура[0].Отбор,
					"Дата", Новый ПолеКомпоновкиДанных("ППДС.ДатаПоступления"), СтрокаТаблицы.ВидСравнения);
				ВидСравненияДата = ВидСравненияСтрокой(СтрокаТаблицы.ВидСравнения);
			ИначеЕсли СтрокаТаблицы.ВыражениеИсточник = "Сумма" Тогда
				бит_ОтчетыБФКлиентСервер.ДобавитьОтбор(НастройкиКомпоновкиДанных.Структура[0].Структура[0].Отбор,
					"Сумма", Новый ПолеКомпоновкиДанных("ППДС.Сумма"), СтрокаТаблицы.ВидСравнения);
				ВидСравненияСумма = ВидСравненияСтрокой(СтрокаТаблицы.ВидСравнения);
			Иначе
				Связь = СхемаКомпоновкиДанных.СвязиНаборовДанных.Добавить();
				ЗаполнитьЗначенияСвойств(Связь, СтрокаТаблицы);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	ВидыСравнения = Новый Структура("ВидСравненияСумма, ВидСравненияДата", ВидСравненияСумма, ВидСравненияДата);
	
	Если СкрыватьДокументыБезПары Тогда
		бит_ОтчетыБФКлиентСервер.ДобавитьОтбор(НастройкиКомпоновкиДанных.Отбор,
			"ППДС.Ссылка", , ВидСравненияКомпоновкиДанных.Заполнено);
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных,,,
							Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	РезультатОбъект = Новый ДеревоЗначений;

	// Вывод таблицы   	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.ОтображатьПроцентВывода = Истина;
	ПроцессорВывода.УстановитьОбъект(РезультатОбъект); 	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	СвязанныеДокументы = НовыеСвязанныеДокументы();
		
	КартинкиСтроки = Новый Структура;
	КартинкиСтроки.Вставить("Монеты",   БиблиотекаКартинок.бит_Монеты);
	КартинкиСтроки.Вставить("Реквизит", БиблиотекаКартинок.бит_Реквизит);
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ВидыСравнения", 				   ВидыСравнения);
	ПараметрыЗаполнения.Вставить("СкрыватьДокументыБезПары", 	   СкрыватьДокументыБезПары);
	ПараметрыЗаполнения.Вставить("АвтоПомечатьНаиболееПодходящие", АвтоПомечатьНаиболееПодходящие);
	ПараметрыЗаполнения.Вставить("КартинкиСтроки", 				   КартинкиСтроки);
	
	ЗаполнитьСвязанныеДокументы(РезультатОбъект.Строки, СвязанныеДокументы.Строки, ПараметрыЗаполнения);

	Возврат СвязанныеДокументы;
	
КонецФункции

Функция ПривязатьДокументы(СвязанныеДокументы) Экспорт
		
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("ОбработанныеСтроки",   СвязанныеДокументы);
	РезультатОбработки.Вставить("ОбработаноДокументов", 0);
	РезультатОбработки.Вставить("ОбработаноСОшибкой",   0);
	
	ПараметрыПоиска = Новый Структура("Пометка, Обработано", Истина, Ложь);
	РезультатПоиска = СвязанныеДокументы.Строки.НайтиСтроки(ПараметрыПоиска, Истина);
	Если НЕ ЗначениеЗаполнено(РезультатПоиска) Тогда
		ТекстСообщения = НСтр("ru = 'Нет отмеченых документов.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат РезультатОбработки;
	КонецЕсли;
	
	ОбработаноДокументов = 0;
	ОбработаноСОшибкой   = 0;
	
	Для каждого СтрокаТаблицы Из РезультатПоиска Цикл
		ПланируемоеПоступление = СтрокаТаблицы.Ссылка;
		ДокументОплаты		   = СтрокаТаблицы.Родитель.Ссылка;
		ОтражениеФакта		   = СтрокаТаблицы.Родитель.ОтражениеФакта;
		ОбработаноДокументов   = ОбработаноДокументов + 1;
		НачатьТранзакцию();
		Попытка
			ПривязатьДокумент(ДокументОплаты, ПланируемоеПоступление, ОтражениеФакта);
			СтрокаТаблицы.Обработано = Истина;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Не удалось обработать документ %1. По причине: %2.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ДокументОплаты, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			ОбработаноСОшибкой = ОбработаноСОшибкой + 1;
		КонецПопытки;
	КонецЦикла;
	
	Если ОбработаноДокументов - ОбработаноСОшибкой > 0 Тогда
		
		// Оставляем в дереве только обработанные строки.
		НовыеСвязанныеДокументы = СвязанныеДокументы.Скопировать();
		НовыеСвязанныеДокументы.Строки.Очистить();
		
		РезультатПоиска = СвязанныеДокументы.Строки.НайтиСтроки(Новый Структура("Обработано", Истина), Истина);
		Если ЗначениеЗаполнено(РезультатПоиска) Тогда
			Для каждого СтрокаТаблицы Из РезультатПоиска Цикл
				НоваяСтрока = НовыеСвязанныеДокументы.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы.Родитель);
				ЗаполнитьЗначенияСвойств(НоваяСтрока.Строки.Добавить(), СтрокаТаблицы);
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("ОбработанныеСтроки",  НовыеСвязанныеДокументы);
	РезультатОбработки.Вставить("ОбработаноДокументов",ОбработаноДокументов);
	РезультатОбработки.Вставить("ОбработаноСОшибкой",  ОбработаноСОшибкой);
	
	Возврат РезультатОбработки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВидСравненияСтрокой(ВидСравнения)
	
	ВидСравненияСтрокой = "";
	Если ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
		ВидСравненияСтрокой = " = ";
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.Больше Тогда 	
		ВидСравненияСтрокой = " > ";
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда 	
		ВидСравненияСтрокой = " >= ";
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше Тогда 	
		ВидСравненияСтрокой = " < ";
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда 	
		ВидСравненияСтрокой = " <= ";	
	КонецЕсли;

	Возврат ВидСравненияСтрокой;
	
КонецФункции

Функция НовыеСвязанныеДокументы()

	СвязанныеДокументы = Новый ДеревоЗначений;	
	СвязанныеДокументы.Колонки.Добавить("Ссылка");
	СвязанныеДокументы.Колонки.Добавить("Пометка", 				   	Новый ОписаниеТипов("Булево"));
	СвязанныеДокументы.Колонки.Добавить("Основной", 			   	Новый ОписаниеТипов("Булево"));
	СвязанныеДокументы.Колонки.Добавить("Дата",  				   	ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	СвязанныеДокументы.Колонки.Добавить("Номер", 				   	ОбщегоНазначения.ОписаниеТипаСтрока(12) );
	СвязанныеДокументы.Колонки.Добавить("Проведен", 			   	Новый ОписаниеТипов("Булево"));
	СвязанныеДокументы.Колонки.Добавить("Организация", 			   	Новый ОписаниеТипов("СправочникСсылка.Организации"));
	СвязанныеДокументы.Колонки.Добавить("НомерВходящегоДокумента", 	ОбщегоНазначения.ОписаниеТипаСтрока(12));
	СвязанныеДокументы.Колонки.Добавить("ДатаВходящегоДокумента",  	ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата) );
	СвязанныеДокументы.Колонки.Добавить("Ответственный", 		   	Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	СвязанныеДокументы.Колонки.Добавить("Сумма",  				   	ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	СвязанныеДокументы.Колонки.Добавить("ДатаПоступления", 		   	ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	СвязанныеДокументы.Колонки.Добавить("Обработано", 			   	Новый ОписаниеТипов("Булево"));
	СвязанныеДокументы.Колонки.Добавить("Контрагент",			   	Неопределено);
	СвязанныеДокументы.Колонки.Добавить("ХозяйственнаяОперация",	Неопределено);
	СвязанныеДокументы.Колонки.Добавить("Картинка",				   	Неопределено);
	СвязанныеДокументы.Колонки.Добавить("Комментарий",			   	Неопределено);
	СвязанныеДокументы.Колонки.Добавить("НазначениеПлатежа",	   	Неопределено);
	СвязанныеДокументы.Колонки.Добавить("Валюта",				   	Неопределено);
	СвязанныеДокументы.Колонки.Добавить("Подразделение", 			Неопределено);
	СвязанныеДокументы.Колонки.Добавить("БанковскийСчетКасса", 		Неопределено);
	СвязанныеДокументы.Колонки.Добавить("Тип", 						Неопределено);
	СвязанныеДокументы.Колонки.Добавить("Статус", 					Неопределено);
	СвязанныеДокументы.Колонки.Добавить("ОтражениеФакта", 			Неопределено);

	Возврат СвязанныеДокументы;
	
КонецФункции

Процедура ЗаполнитьСвязанныеДокументы(КоллекцияИсточник, КоллекцияПриемник, ПараметрыЗаполнения)

	ВидыСравнения				   = ПараметрыЗаполнения.ВидыСравнения;
	СкрыватьДокументыБезПары	   = ПараметрыЗаполнения.СкрыватьДокументыБезПары;
	АвтоПомечатьНаиболееПодходящие = ПараметрыЗаполнения.АвтоПомечатьНаиболееПодходящие;
	КартинкиСтроки 				   = ПараметрыЗаполнения.КартинкиСтроки;
	
	ПометкаУстановлена = Ложь;
	Для каждого ЭлементКоллекции Из КоллекцияИсточник Цикл
		Если ЭлементКоллекции.Уровень() = 0 Тогда
			Если СкрыватьДокументыБезПары И ЭлементКоллекции.Строки.Количество() = 0 Тогда
				Продолжить;		
			КонецЕсли;
			НоваяСтрока = КоллекцияПриемник.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементКоллекции);
			ЗаполнитьСвязанныеДокументы(ЭлементКоллекции.Строки, НоваяСтрока.Строки, ПараметрыЗаполнения);
			НоваяСтрока.Основной = Истина;
			НоваяСтрока.Картинка = КартинкиСтроки.Монеты;
		Иначе
			НоваяСтрока = КоллекцияПриемник.Добавить();
			ПоляППДС = Новый Структура;
			ПоляППДС.Вставить("ППДССсылка","Ссылка");
			ПоляППДС.Вставить("ППДССумма","Сумма");
			ПоляППДС.Вставить("ППДСБанковскийСчетКасса","БанковскийСчетКасса");
			ПоляППДС.Вставить("ППДСКонтрагент","Контрагент");
			ПоляППДС.Вставить("ППДСДата","Дата");
			ПоляППДС.Вставить("ППДСНомер","Номер");
			ПоляППДС.Вставить("ППДСОрганизация","Организация");
			ПоляППДС.Вставить("ППДСТип","Тип");
			ПоляППДС.Вставить("ППДСВалюта","Валюта");
			ПоляППДС.Вставить("ППДСДатаПоступления","ДатаПоступления");
			Для каждого КлючЗначение Из ПоляППДС Цикл
				НоваяСтрока[КлючЗначение.Значение] = ЭлементКоллекции[КлючЗначение.Ключ]; 	
			КонецЦикла;

			Если НЕ ПометкаУстановлена Тогда
				ВидСравненияСумма 		= ВидыСравнения.ВидСравненияСумма; 
				ВидСравненияДата  		= ВидыСравнения.ВидСравненияДата;
				ВыражениеСравненияСумма = "ИСТИНА";
				ВыражениеСравненияДата  = "ИСТИНА";
				Если ЗначениеЗаполнено(ВидСравненияСумма) Тогда
					ВыражениеСравненияСумма = СтрШаблон("%1 %2 %3", "ЭлементКоллекции.Сумма", ВидСравненияСумма, "ЭлементКоллекции.ППДССумма");
				КонецЕсли;
				Если ЗначениеЗаполнено(ВидСравненияДата) Тогда
					ВыражениеСравненияДата = СтрШаблон("%1 %2 %3", "ЭлементКоллекции.Дата", ВидСравненияДата, "ЭлементКоллекции.ППДСДатаПоступления");
				КонецЕсли;

				Если АвтоПомечатьНаиболееПодходящие И Вычислить(ВыражениеСравненияСумма) И Вычислить(ВыражениеСравненияДата) Тогда
					НоваяСтрока.Пометка = Истина;
					ПометкаУстановлена  = Истина;
				КонецЕсли;
			КонецЕсли;
			НоваяСтрока.Картинка = КартинкиСтроки.Реквизит;
		КонецЕсли;	
	КонецЦикла;	

КонецПроцедуры

Процедура ПривязатьДокумент(ДокументОплаты, ПланируемоеПоступление, ОтражениеФакта)
	
	ДокументОбъект = ОтражениеФакта.ПолучитьОбъект();
	ДокументОбъект.Заблокировать();

	ПозицииПоступления		 = Документы.бит_кзн_ПозицияПоступления.НайтиПозициюПоОснованию(ПланируемоеПоступление).МассивПозиций; 
	ДанныеПозицийПоступления = Документы.бит_кзн_ПозицияПоступления.РеквизитыДокумента(ПозицииПоступления);
	
	ЕстьРасшифровкаПлатежа = бит_Казначейство.ЕстьРасшифровкаПлатежа(ДокументОплаты);
	Если ЕстьРасшифровкаПлатежа Тогда
		РасшифровкаПлатежа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОплаты, "РасшифровкаПлатежа").Выгрузить();
	Иначе	
		РасшифровкаПлатежа = Новый ТаблицаЗначений;
		РасшифровкаПлатежа.Колонки.Добавить("ИдентификаторСтроки");
	КонецЕсли;
	
	НовыеФактическиеДанные = ДокументОбъект.ФактическиеДанные.Выгрузить();
	НовыеФактическиеДанные.Очистить();
	
	Для каждого СтрокаРаспределения Из ДокументОбъект.ФактическиеДанные Цикл
		
		ОбъектРасчетов = Неопределено;
		Если ЗначениеЗаполнено(СтрокаРаспределения.ИдентификаторСтроки) Тогда
			ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", СтрокаРаспределения.ИдентификаторСтроки);	
			РезультатПоискаРасшифровка = РасшифровкаПлатежа.НайтиСтроки(ПараметрыОтбора);
			Если ЗначениеЗаполнено(РезультатПоискаРасшифровка) Тогда
				ОбъектРасчетов = РезультатПоискаРасшифровка[0].ОбъектРасчетов;
				Если ЗначениеЗаполнено(ОбъектРасчетов) Тогда
					ТипОбъекта 		 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектРасчетов, "ТипСсылки");
					ТипСсылкиДоговор = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Справочники.ДоговорыКонтрагентов);
					Если ТипОбъекта <> ТипСсылкиДоговор Тогда
						ОбъектРасчетов = Неопределено;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Поиск по объекту расчетов. Если пустой или ничего не найдено, копируем данные всей таблицы планируемого поступления.
		РезультатПоиска = Неопределено;
		Если ЗначениеЗаполнено(ОбъектРасчетов) Тогда
			ПараметрыОтбора = Новый Структура("ОбъектРасчетов", ОбъектРасчетов);
			РезультатПоиска = ДанныеПозицийПоступления.Скопировать(ПараметрыОтбора);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(РезультатПоиска) Тогда
			РезультатПоиска = ДанныеПозицийПоступления.Скопировать();	
		КонецЕсли;
		
		
		Коэффициенты		   = РезультатПоиска.ВыгрузитьКолонку("СуммаВзаиморасчетов");
		РезультатРаспределения = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
									СтрокаРаспределения.СуммаВзаиморасчетов, Коэффициенты, 2);
								
		Если ТипЗнч(РезультатРаспределения) = Тип("Массив") Тогда
			РезультатПоиска.ЗагрузитьКолонку(РезультатРаспределения, "СуммаВзаиморасчетов");	
		КонецЕсли;	

		РезультатРаспределения = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
									СтрокаРаспределения.СуммаОплаты, Коэффициенты, 2);
									
		Если ТипЗнч(РезультатРаспределения) = Тип("Массив") Тогда
			РезультатПоиска.ЗагрузитьКолонку(РезультатРаспределения, "СуммаДокумента");	
		Иначе
			Если ЗначениеЗаполнено(РезультатПоиска) Тогда
				РезультатРаспределения = Новый Массив(РезультатПоиска.Количество());
				РезультатПоиска.ЗагрузитьКолонку(РезультатРаспределения, "СуммаДокумента");			
			КонецЕсли;
		КонецЕсли;	

		Для каждого Запись Из РезультатПоиска Цикл
			НоваяСтрока = НовыеФактическиеДанные.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись); 
			НоваяСтрока.ИдентификаторСтроки = СтрокаРаспределения.ИдентификаторСтроки;
			НоваяСтрока.Период 				= Запись.ДатаПлан;
			НоваяСтрока.СуммаОплаты 		= Запись.СуммаДокумента;
		КонецЦикла;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(НовыеФактическиеДанные) Тогда
		ДокументОбъект.ФактическиеДанные.Загрузить(НовыеФактическиеДанные);
	КонецЕсли;
	
	Документы.бит_ОтражениеФактаДДС.ЗаполнитьАналитикиШапкиПоФактическимДанным(
		ДокументОбъект.ДокументОснование.Метаданные(), ДокументОбъект.ФактическиеДанные, ДокументОбъект.Аналитики);
		
	ДокументОбъект.Записать();

	ДокументПроведен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОплаты, "Проведен");
	Если ДокументПроведен Тогда
		Попытка
			бит_Казначейство.ОбработкаПроведенияПлатежногоДокумента(ДокументОплаты.ПолучитьОбъект(), Ложь, 
				РежимЗаписиДокумента.Запись, Истина);	
		Исключение
			ТекстСообщения = НСтр("ru = 'Не удалось отразить фактические данные у документа %1. По причине: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ДокументОплаты, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДокументОплаты);
		КонецПопытки;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#КонецЕсли
